{
    "_id": "projects2",
    "created_at": "",
    "updated_at": "",
    "projects": [
        {
            "title": "Movie Lists",
            "cardImgUrl": "https://res.cloudinary.com/bk-store/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1720860672/English_Literature_Notes_mcvttw.jpg",
            "description": "<span><strong style='font-size: 1.5em; margin-bottom:1em;'>Project Overview</strong></span> <p>The Movie Watchlist App is a dynamic web application that offers a variety of features designed to enhance users' movie-watching experience:</p> <h2 id='features'>Features</h2> <ul> <li><p><strong>Create a New Account</strong>: Users can create a new account using their email address. No email validation is required.</p></li> <li><p><strong>Log In and Out</strong>: Users can log in and out of their accounts using their email addresses.</p></li> <li><p><strong>Search Movies</strong>: Users can search for movies by title using data fetched from the Open Movie Database API (OMDb API).</p></li> <li><p><strong>View Movie Details</strong>: Users can view details about movies including title, release year, poster, and plot summary.</p></li> <li><p><strong>Manage Watchlist</strong>: Users can add movies to their personal watchlist and remove movies from their watchlist.</p></li> <li><p><strong>View Watchlist</strong>: Users can view their personal watchlist, which is stored locally to maintain user-specific data across sessions.</p></li> </ul> <h2 id='frontend-tech'>Frontend Technology</h2> <p>These applications are built using the following frontend technologies:</p> <ul> <li><p><strong>ReactJs</strong>: Provides a robust framework for building dynamic user interfaces.</p></li> <li><p><strong>JavaScript</strong>: Powers the logic and interactions within the applications.</p></li> <li><p><strong>Tailwind CSS</strong>: Ensures responsive and modern styling across all devices.</p></li> <li><p><strong>Lucide React and React-Feather</strong>: Used for incorporating a variety of icons into the UI.</p></li> <li><p><strong>Redux and Redux Toolkit</strong>: Manages the application state efficiently and predictably.</p></li> </ul> <h2 id='backend-tech'>Backend Technology</h2> <p>The backend of these applications leverages the following technologies:</p> <ul> <li><p><strong>Node.js</strong>: Serves as the runtime environment for executing server-side code.</p></li> <li><p><strong>Express.js</strong>: A web application framework for building robust APIs and handling HTTP requests.</p></li> <li><p><strong>JWT (JSON Web Tokens)</strong>: Provides secure user authentication.</p></li> <li><p><strong>Multer</strong>: Handles file uploads efficiently.</p></li> <li><p><strong>Mongoose</strong>: An ODM (Object Data Modeling) library for MongoDB, facilitating schema-based data modeling.</p></li> <li><p><strong>MongoDB</strong>: A NoSQL database for storing user data and application information.</p></li> </ul>",
            "repoUrl": "https://github.com/BittuKumar726/movies-lists",
            "demoUrl": "https://bkwatchlists.netlify.app",
            "startDate": "",
            "endDate": ""
        },
        {
            "title": "Meal Hub",
            "cardImgUrl": "https://res.cloudinary.com/bk-store/image/upload/v1719077925/youtube-banner-8077450_1280_b8e0yu.jpg",
            "description": "<span><strong style='font-size: 1.5em; margin-bottom:1em;'>Project Overview</strong></span> <p>Meal Hub is a dynamic web application. It offers a variety of features designed to enhance users' culinary experience:</p> <h2 id='features'>Features</h2> <ul> <li><p><strong>Menu Exploration</strong>: Users can browse through various meal categories, discovering a wide array of dishes tailored to their preferences.</p> </li> <li><p><strong>Favorite Meals</strong>: A personalized feature allows users to save their favorite meals for easy access and reference.</p> </li> <li><p><strong>Random Meal Generator</strong>: Provides users with a random meal suggestion for culinary inspiration or a surprise dish.</p> </li> <li><p><strong>About Section</strong>: Learn more about the website, its creators, and its development journey through the dedicated About section.</p> </li> <li><p><strong>Responsive Design</strong>: Optimized for various devices, ensuring a seamless experience whether accessed from a desktop, tablet, or mobile phone.</p> </li> </ul> <p>Explore <a href='https://bkmealhub.netlify.app/'>Meal Hub</a> today to discover and enjoy a world of culinary delights!</p>",
            "repoUrl": "https://github.com/BittuKumar726/meal-hub-v1",
            "demoUrl": "https://bkmealhub.netlify.app/",
            "startDate": "",
            "endDate": ""
        },
        {
            "title": "Online eBook Store Project",
            "cardImgUrl": "https://res.cloudinary.com/bk-store/image/upload/v1717068660/bkport/online-exam_wkgt2l.jpg",
            "description": "<span><strong style='font-size: 1.5em; margin-bottom:1em;'>Project Overview</strong></span> <p>Developed an online eBook store featuring a variety of books, including story, study, sports and more. This web application offers a seamless user experience for exploring and reading eBooks.</p> <h2 id='technologies-used'>Technologies Used</h2> <ul> <li><p><strong>Frontend</strong>: React, JavaScript, Tailwind CSS, daisyUI, CSS & HTML</p></li> <li><p><strong>Backend</strong>: Node.js, Express.js, bcrypt, Cloudinary, cookie-parser, JWT</p></li> <li><p><strong>Database</strong>: MongoDB, Mongoose</p></li> <li><p><strong>Version Control</strong>: Git</p></li> </ul> <h2 id='key-features'>Key Features</h2> <ul> <li><p><strong>User Authentication</strong>: Secure registration and login with JWT-based sessions.</p></li> <li><p><strong>Book Management</strong>: Admin panel for book management and Cloudinary integration for cover images.</p></li> <li><p><strong>Browsing and Search</strong>: Browse by categories and powerful search functionality.</p></li> <li><p><strong>Book Details</strong>: Detailed book views with descriptions and reviews.</p></li> <li><p><strong>User Reviews and Ratings</strong>: Users can review and rate books.</p></li> <li><p><strong>Responsive Design</strong>: Mobile-friendly interface.</p></li> </ul> <h2 id='challenges-and-solutions'>Challenges and Solutions</h2> <ul> <li><p><strong>Scalability</strong>: Optimized database queries and efficient data structures.</p></li> <li><p><strong>Security</strong>: Implemented robust authentication and authorization.</p></li> <li><p><strong>User Experience</strong>: Created an intuitive and engaging UI.</p></li> </ul>",
            "repoUrl": "https://github.com/AdityaRaj140/learning-pro",
            "demoUrl": "https://bkumarstore.netlify.app/",
            "startDate": "",
            "endDate": ""
        },
        {
            "title": "Comments Widget",
            "cardImgUrl": "https://res.cloudinary.com/bk-store/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1717077254/comment-widget_unjgxd.jpg",
            "description": "<p>The Hierarchical Commenting System is a dynamic and user-friendly comment widget designed to enhance user interaction on web platforms. This widget allows users to post comments in a hierarchical structure, enabling replies to specific comments, creating nested conversations. Each comment includes features such as editing, deleting, and displaying the time frame of the comment, offering a comprehensive and interactive user experience.</p> <h3 id='key-features'>Key Features</h3> <ul> <li><strong>Hierarchical Commenting</strong>: Users can reply to specific comments, forming a tree-like structure for discussions.</li> <li><strong>Edit and Delete Options</strong>: Users can edit or delete their comments at any time.</li> <li><strong>Time Frame Display</strong>: Each comment shows the time it was posted or last edited.</li> <li><strong>User-Friendly Interface</strong>: Built with Ant Design for a sleek and intuitive user interface.</li> </ul> <h3 id='tech-stack'>Tech Stack</h3> <ul> <li><strong>React</strong>: For building the dynamic and responsive user interface.</li> <li><strong>HTML</strong>: To structure the web content.</li> <li><strong>CSS & node-sass</strong>: For styling the widget, including support for SCSS syntax.</li> <li><strong>JavaScript</strong>: For handling the logic and interactions.</li> <li><strong>Ant Design</strong>: To provide a polished and consistent design framework.</li> <li><strong>moment.js</strong>: To manage and display date and time information effectively.</li> </ul>",
            "repoUrl": "https://github.com/BittuKumar726/comments-widget",
            "demoUrl": "https://bittukumar726.github.io/comments-widget",
            "startDate": "",
            "endDate": ""
        },
        {
            "title": "Speech Recognition",
            "cardImgUrl": "https://res.cloudinary.com/bk-store/image/upload/v1717068661/bkport/speech_d9y4q3.jpg",
            "description": "Speech recognition is to convert speech into a sequence of words by a computer program.<br/> -> Speech recognition applications include voice user interface such as voice dialing.<br/> -> As the most natural communication modality for humans, the ultimate dream of speech recognition is to enable people to communicate more naturally and effectively.<br/> -> User can easily control the system & play with personal assistance.",
            "repoUrl": "https://github.com/BittuKumar726/SpeechRecognition.git",
            "demoUrl": "",
            "startDate": "",
            "endDate": ""
        },
        {
            "title": "COVID-19 TRACKER",
            "cardImgUrl": "https://res.cloudinary.com/bk-store/image/upload/v1717068662/bkport/corona_g43uft.jpg",
            "description": "-> The World Health Organization has declared the outbreak of the novel coronavirus, COVID-19 a pandemic across the world. With its alarming surge of affected cases throughout the world, lockdown, and awareness (social distancing, use of masks etc.) <br/> -> This application is designed to track the current COVID cases in the world and also country-wise.",
            "repoUrl": "",
            "demoUrl": "https://bittukumar726.github.io/covid-19-tracker/",
            "startDate": "",
            "endDate": ""
        },
        {
            "title": "Real Time Chat Application",
            "cardImgUrl": "https://res.cloudinary.com/bk-store/image/upload/v1717068661/bkport/chat1_qwvok2.jpg",
            "description": "-> Developed a real time chat application where the users can create their Username & start chatting with the other people in the chat room.",
            "repoUrl": "",
            "demoUrl": "https://chatvet.herokuapp.com/index.html",
            "startDate": "",
            "endDate": ""
        }
    ]
}